# Initialize

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
brew 'mas'



# Security

cask 'viscosity'
cask 'keybase'



# Browsers

cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'brave-browser'



# Utilities

cask 'dropbox'
cask 'box-drive'
cask 'pock'
cask 'muzzle'
cask 'dozer'
cask 'bettertouchtool'
mas "Amphetamine", id: 937984704
mas "1Password 7", id: 1333542190
mas "Divvy", id: 413857545



# Design Tools

cask 'figma'
cask 'kap'
cask 'screenflow'
cask 'iconjar'
cask 'sketch'
cask 'sketchup'
mas "GIF Brewery 3", id: 1081413713
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Annotate", id: 918207447
mas "Contrast", id: 1254981365



# Fonts

cask 'font-open-sans'
cask 'font-fira-code'



# Productivity

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Todoist", id: 585829637
mas "TickTick", id: 966085870
mas "Day One", id: 1055511498
mas "Bear", id: 1091189122
mas "Jira", id: 1475897096
cask 'textexpander'
cask 'notion'
cask 'alfred'


# Communications

cask 'zoomus'
cask 'krisp'
mas "Slack", id: 803453959
cask 'discord'


# Entertainment

cask 'spotify'
mas "Pocket", id: 568494494



# Shells

brew 'bash'
brew 'zsh'
brew 'fish'



# Editors

cask 'visual-studio-code'
brew 'vim'
brew 'emacs'
mas "Xcode", id: 497799835



# Terminal

cask 'hyper'



# Developer Tools

brew 'git'
cask 'github'
cask 'insomnia'
brew 'yarn'
cask 'dash'
cask 'ngrok'
brew 'ag'
brew 'node'
brew 'npm'
brew 'nvm'
brew 'wget'
brew 'yarn'
brew 'exa'
brew 'prisma'
brew 'deno'


# Databases

brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
cask 'sequel-pro'
brew 'sqlite'
