# Initialize

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
# tap 'hashicorp/tap'
brew 'mas'



# Security

# cask 'viscosity'



# Browsers

cask 'firefox-developer-edition'
cask 'google-chrome'



# Utilities

# cask 'dropbox'
# cask 'box-drive'
mas "Amphetamine", id: 937984704
mas "1Password 7", id: 1333542190
# mas "Divvy", id: 413857545
mas "hazeover-distraction-dimmer", id: 430798174
mas "Magnet", id: 441258766



# Design Tools

cask 'figma'
# cask 'screenflow'
# cask 'iconjar'
# cask 'sketch'
mas "GIF Brewery 3", id: 1081413713
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Contrast", id: 1254981365



# Fonts

# cask 'font-open-sans'
cask 'font-fira-code'



# Productivity

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Todoist", id: 585829637
# cask 'notion'
cask 'alfred'
cask 'obsidian'
cask 'zappy'



# Communications

cask 'loom'
cask 'zoom'
cask 'krisp'
mas "Slack", id: 803453959



# Entertainment

cask 'spotify'
mas "somafm-radio-player", id: 449155338
# mas "Pocket", id: 568494494



# Shells

brew 'bash'
brew 'zsh'



# Editors

cask 'visual-studio-code'
brew 'vim'
# brew 'neovim'
# brew 'emacs'
# mas "Xcode", id: 497799835



# Terminal

cask 'hyper'
brew 'tmux'
cask 'iterm2'


# Developer Tools

brew 'git'
cask 'github'
# cask 'insomnia'
brew 'yarn'
cask 'ngrok'
brew 'ag'
brew 'node'
brew 'npm'
brew 'nvm'
brew 'wget'
brew 'yarn'
# brew 'exa'
# brew 'deno'
brew 'direnv'
brew 'imagemagick'


# Databases

# brew 'postgresql', restart_service: true
# brew 'redis', restart_service: true
# cask 'sequel-pro'
# brew 'sqlite'
